runtime/qwen3.6-27b/bench-20260722-042135-matrix-20260722-034243-H.log
Started: 2026-07-22T04:21:35+00:00
Command: vllm bench serve --backend openai-chat --host 127.0.0.1 --port 8000 --endpoint /v1/chat/completions --model qwen3.6-27b --tokenizer /root/models/Qwen3.6-27B --dataset-name random --random-input-len 32768 --random-output-len 1024 --num-prompts 64 --request-rate inf --max-concurrency 8 --seed 1024 --trust-remote-code --extra-body \{\"temperature\":0\,\"chat_template_kwargs\":\{\"enable_thinking\":false\}\} --save-result --result-dir /root/models/tim_tmp/runtime/qwen3.6-27b --result-filename bench-20260722-042135-matrix-20260722-034243-H.json

INFO 07-22 04:21:46 [__init__.py:44] Available plugins for group vllm.platform_plugins:
INFO 07-22 04:21:46 [__init__.py:46] - ascend -> vllm_ascend:register
INFO 07-22 04:21:46 [__init__.py:49] All plugins in this group will be loaded. Set `VLLM_PLUGINS` to control which plugins to load.
INFO 07-22 04:21:46 [__init__.py:238] Platform plugin ascend is activated
INFO 07-22 04:21:46 [platform.py:62] Breakable cudagraph is force disabled on Ascend because DeepSeek V4 PIECEWISE cudagraph is not supported yet.
2026-07-22 04:21:58,632 - 104071 - ServiceProfiler - INFO - VLLM_USE_V1 not set, auto-detected via vLLM 0.23.0+empty: default 1
INFO 07-22 04:21:59 [__init__.py:115] Registered model loader `<class 'vllm_ascend.model_loader.netloader.netloader.ModelNetLoaderElastic'>` with load format `netloader`
INFO 07-22 04:21:59 [__init__.py:115] Registered model loader `<class 'vllm_ascend.model_loader.rfork.rfork_loader.RForkModelLoader'>` with load format `rfork`
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xfffedfc2e3e0>, trust_remote_code=True, seed=1024, num_prompts=64, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=32768, random_output_len=1024, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=8, model='qwen3.6-27b', input_len=None, output_len=None, tokenizer='/root/models/Qwen3.6-27B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/root/models/tim_tmp/runtime/qwen3.6-27b', result_filename='bench-20260722-042135-matrix-20260722-034243-H.json', ignore_eos=False, self_timed=None, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-8ae06a1d-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body={'temperature': 0, 'chat_template_kwargs': {'enable_thinking': False}}, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 07-22 04:22:02 [utils.py:90] Sampling input_len from [32768, 32768] and output_len from [1024, 1024]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 8
100%|██████████| 64/64 [12:07<00:00, 11.36s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     64        
Failed requests:                         0         
Maximum request concurrency:             8         
Benchmark duration (s):                  727.30    
Total input tokens:                      2097949   
Total generated tokens:                  65536     
Request throughput (req/s):              0.09      
Output token throughput (tok/s):         90.11     
Peak output token throughput (tok/s):    124.00    
Peak concurrent requests:                12.00     
Total token throughput (tok/s):          2974.67   
---------------Time to First Token----------------
Mean TTFT (ms):                          47914.98  
Median TTFT (ms):                        59435.04  
P99 TTFT (ms):                           64374.31  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          38.64     
Median TPOT (ms):                        42.32     
P99 TPOT (ms):                           54.42     
---------------Inter-token Latency----------------
Mean ITL (ms):                           130.81    
Median ITL (ms):                         65.35     
P99 ITL (ms):                            3665.82   
---------------Speculative Decoding---------------
Acceptance rate (%):                     79.67     
Acceptance length:                       3.39      
Drafts:                                  19341     
Draft tokens:                            58023     
Accepted tokens:                         46228     
Per-position acceptance (%):
  Position 0:                            91.42     
  Position 1:                            78.70     
  Position 2:                            68.90     
==================================================